// - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
// let x = 55;
// // let a = 1;
// let a = 0;
// // let a = -3;
// if (x !==0) {
//     console.log('yes');
// }else {
//     console.log('no');
// }if (a !==0){
//     console.log('yes');
// }

//
// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

// let times = 13;
// if (times >= 0 && times <= 15){
//     document.write('<h1>1</h1>');
// }else if (times >= 16 && times <= 30) {
//     document.write('<h1>2</h1>');
// }else if (times >= 31 && times <= 45) {
//     document.write('<h1>3</h1>');
// }else if (times => 46 && times <= 60) {
//     document.write('<h1>4</h1>');
// }
// - Скласти розклад на тиждень за домопоги switch.
// Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день
// (можна замість плану на день, назву дня англійською).
// switch ('6') {
//     case "1":
//         console.log('Monday');
//         break;
//     case "2":
//         console.log('Tuesday');
//         break;
//     case "3":
//         console.log('Wednesday');
//         break;
//     case "4":
//         console.log('Thursday');
//         break;
//     case "5":
//         console.log('Friday');
//         break;
//     case "6":
//         console.log('Saturday');
//         break;
//     case "7":
//         console.log('Sunday');
//         break;
//
// }

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
// let day = '5';
// if (day  < 10){
//     document.write('<h1>10</h2>')
// }else if (day > 10 && day < 20) {
//     document.write('<h1>20</h2>');
// }else if (day > 20 && day < 31) {
//     document.write('<h1>30</h2>')
// }
//
//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.
// let v = 10;
// let w = 6;
// if (v > w) {
//     console.log('yes');
// }else if (w > v) {
//     console.log('no')
// }


//
//     - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"
    //         якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)
let x = '';
if (x) {
    console.log(true);
} else {
    console.log(false)
}
